## Q1. List any five functions of the pandas library with execution.

### 1. Read Data
### We can read data in pandas data frame as read_csv(). Two most used data read formats are csv and excel. If we are reading data in excel format, we can also give sheet names.
### 2. Head and Tail 
### To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. In contrast to see below rows, we can use df.tail().
### 3. Shape, Size and Info
### Two most basic functions after reading data is to know the number of rows and columns, and to know the datatype of variables. We can use df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame. We can also use df.info(), from that we get different information such as rows from RangeIndex, Data columns and then data type of each column. It also includes the information of non-null counts.
### 4. isna
### If one needs to get the total number of null values in a data, we can use df.isna() as below. Sum will give the total null values. If we want just one variable null values, we can also get it by giving the name of the variable
### 5. Describe
### Then to understand basic statistics of variables we can use df.describe(). It will give you count, mean, standard deviation, and also 5 number summary.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic_data.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df.shape

(891, 12)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [10]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
def reindexed_dataFrame(df):
    new_index=range(1,2*len(df)+1,2)
    df_reindexed=df.set_index(pd.Index(new_index))
    return df_reindexed
df=pd.DataFrame({'A':[1,2,3],
                 'B':[4,5,6],
                 'C':[7,8,9]})
df_reindexed=reindexed_dataFrame(df)
print(df_reindexed)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [20]:
import pandas as pd

def calculate_sum_of_first_three_simple(df):
    if 'Values' not in df.columns:
        print("Error: 'Values' column not found in the DataFrame.")
        return   
    sum_of_first_three = df['Values'].head(3).sum()
    print("Sum of the first three values:", sum_of_first_three)

df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
calculate_sum_of_first_three_simple(df)

Sum of the first three values: 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
import pandas as pd

def add_word_count_column_simple():
    data = {'Text': ["This is a sample text", "Another example", "Just a few words"]}
    df = pd.DataFrame(data)
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    print("Original DataFrame:")
    print(df)
add_word_count_column_simple()

Original DataFrame:
                    Text  Word_Count
0  This is a sample text           5
1        Another example           2
2       Just a few words           4

## Q5. How are DataFrame.size() and DataFrame.shape() different?

### DataFrame.size() - The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.
### DataFram.shape() - The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

## Q6. Which function of pandas do we use to read an excel file?

### We use read_excel function to read excel files
### Example :

In [22]:
df=pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [1]:
import pandas as pd

def extract_username_from_email(df):
    if 'Email' not in df.columns:
        print("Error: 'Email' column not found in the DataFrame.")
        return
    df['Username'] = df['Email'].str.split('@').str[0]

df = pd.DataFrame({'Email': ["john.doe@example.com", "alice.smith@example.com", "bob.jones@example.com"]})

extract_username_from_email(df)
print(df)

                     Email     Username
0     john.doe@example.com     john.doe
1  alice.smith@example.com  alice.smith
2    bob.jones@example.com    bob.jones

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Assignment

Data Science Masters

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows."

In [2]:
import pandas as pd

def select_rows_by_conditions(df):
    if 'A' not in df.columns or 'B' not in df.columns:
        print("Error: Columns 'A' and 'B' are required in the DataFrame.")
        return
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

    return selected_rows
df = pd.DataFrame({'A': [3, 8, 6, 2, 9],
                   'B': [5, 2, 9, 3, 1],
                   'C': [1, 7, 4, 5, 2]})
selected_rows_df = select_rows_by_conditions(df)
print(selected_rows_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [4]:
df=pd.DataFrame({'Values':[10,20,30,40,50,60,70,80,90]})
mean=df['Values'].mean()
median=df['Values'].median()
sd=df['Values'].std()
print("Mean",mean)
print("Median",median)
print("Standard Deviation",sd)

Mean 50.0
Median 50.0
Standard Deviation 27.386127875258307

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [5]:
import pandas as pd

def calculate_moving_average(df):

    if 'Sales' not in df.columns or 'Date' not in df.columns:
        print("Error: 'Sales' and 'Date' columns are required in the DataFrame.")
        return
    df = df.sort_values(by='Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

df = pd.DataFrame({'Sales': [10, 20, 15, 25, 30, 18, 22],
                'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07'])})

df_with_ma = calculate_moving_average(df)

print(df_with_ma)

   Sales       Date  MovingAverage
0     10 2023-01-01      10.000000
1     20 2023-01-02      15.000000
2     15 2023-01-03      15.000000
3     25 2023-01-04      17.500000
4     30 2023-01-05      20.000000
5     18 2023-01-06      19.666667
6     22 2023-01-07      20.000000

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [7]:
import pandas as pd

def add_weekday_column(df):

    if 'Date' not in df.columns:
        print("Error: 'Date' column not found in the DataFrame.")
        return
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03','2023-01-04','2023-01-05']})
add_weekday_column(df)
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [8]:
import pandas as pd

def select_rows_by_date_range(df):

    if 'Date' not in df.columns:
        print("Error: 'Date' column not found in the DataFrame.")
        return

    df['Date'] = pd.to_datetime(df['Date'])

    start_date = '2023-01-01'
    end_date = '2023-01-31'

    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return selected_rows

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10']})
selected_rows_df = select_rows_by_date_range(df)
print(selected_rows_df)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### The first and foremost library that needs to be imported to use the basic functions of Pandas is, unsurprisingly, the Pandas library itself. You can import Pandas using the following convention:
import pandas as pd
## Here, pd is a commonly used alias for the Pandas library, and it makes it more convenient to reference Pandas functions. Once you have imported Pandas, you can use its various functions and classes to work with tabular data in the form of DataFrames and Series.